Лицензия MIT

Copyright (c) 2026 GeeKaZ0iD

Настоящим бесплатно предоставляется разрешение любому лицу, получившему
копию данного программного обеспечения и сопутствующей документации
(далее — «Программное обеспечение»), использовать Программное обеспечение
без ограничений, включая без ограничения права на использование, копирование,
изменение, слияние, публикацию, распространение, сублицензирование и/или
продажу копий Программного обеспечения, а также разрешать лицам, которым
предоставляется Программное обеспечение, делать то же самое, при соблюдении
следующих условий:

Указанное выше уведомление об авторских правах и настоящее разрешение
должны быть включены во все копии или существенные части Программного
обеспечения.

ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО
ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ
ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ, ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ И
НЕНАРУШЕНИЯ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ
ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, ЗА УЩЕРБ
ИЛИ ПО ИНЫМ ТРЕБОВАНИЯМ, В ТОМ ЧИСЛЕ В СЛУЧАЕ ДОГОВОРНОЙ,
ДЕЛИКТНОЙ ИЛИ ИНОЙ ОТВЕТСТВЕННОСТИ, ВОЗНИКШИМ ИЗ ПРОГРАММНОГО
ОБЕСПЕЧЕНИЯ, В СВЯЗИ С НИМ ИЛИ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО
ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ ДЕЙСТВИЙ С НИМ.
